#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_Assault_Stark_Athena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "B_Assault_Generic_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Assault_Stark_Athena.B_Assault_Stark_Athena_C
// 0x0040 (0x12D8 - 0x1298)
class AB_Assault_Stark_Athena_C final : public AB_Assault_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Assault_Stark_Athena_C;           // 0x1298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsTargetting;                                      // 0x12A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A1[0x7];                                     // 0x12A1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class USoundBase*                             TransformIntoADSAudio;                             // 0x12A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             TransformOutOfADSAudio;                            // 0x12B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ADSColor;                                          // 0x12B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HipfireColor;                                      // 0x12C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Assault_Stark_Athena(int32 EntryPoint);
	void K2_OnUnEquip();
	void OnSetTargeting(bool bNewIsTargeting);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Assault_Stark_Athena_C">();
	}
	static class AB_Assault_Stark_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Assault_Stark_Athena_C>();
	}
};

}

