#pragma once
//Andreu Port (12.61)
/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_Wumba

#include "../SDK.hpp"

namespace SDK
{

	// BlueprintGeneratedClass B_Athena_Wumba.B_Athena_Wumba_C
	// 0x03B0 (0x0F20 - 0x0B70)
	class AB_Athena_Wumba_C final : public ABuildingItemWeaponUpgradeActor
	{
	public:
		struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
		class UAudioComponent* Search_Sound_Loop;                                 // 0x0B78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		class UFortLinkToActorComponent* FortLinkToActor;                                   // 0x0B80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		class UChildActorComponent* EditorOnly_MeshPreview;                            // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		class UStaticMeshComponent* CylinderDistance;                                  // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		class USphereComponent* SphereDetail;                                      // 0x0B98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		class UWidgetComponent* UI_InteractionPoint_Sidegrade;                     // 0x0BA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		class UWidgetComponent* UI_InteractionPoint_Upgrade;                       // 0x0BA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		class UWumba_ItemCostComponent_Horizontal_C* Wumba_ItemCostComponent_Horizontal;                // 0x0BB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		class UBoxComponent* TableCollision;                                    // 0x0BB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		class UBoxComponent* PostCollision;                                     // 0x0BC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		class UBoxComponent* TopCollision;                                      // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		class UBoxComponent* BaseCollision;                                     // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		class UParticleSystemComponent* P_UpgradeFX;                                       // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		class UParticleSystemComponent* P_TableLightIdle;                                  // 0x0BE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		class UParticleSystemComponent* P_Destroyed;                                       // 0x0BE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		class UAudioComponent* Flashing_Light_Sound_Loop;                         // 0x0BF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		class UStaticMeshComponent* S_LootTiered_Athena_FloorLoot_01;                  // 0x0BF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		class USkeletalMeshComponent* SK_Wumba;                                          // 0x0C00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		class UWumba_ItemCostComponent_C* Wumba_ItemCostComponent;                           // 0x0C08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		class UForceFeedbackComponent* ForceFeedbackFail;                                 // 0x0C10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		class UForceFeedbackComponent* ForceFeedbackSuccess;                              // 0x0C18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		class UAudioComponent* VendingMachine_Ambient;                            // 0x0C20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		class USceneComponent* DefaultSceneRoot;                                  // 0x0C28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
		float                                         Timeline_1_Light_F9C064A347D6CF3499CF96B51F1F7AF8; // 0x0C30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		ETimelineDirection                            Timeline_1__Direction_F9C064A347D6CF3499CF96B51F1F7AF8; // 0x0C34(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		uint8                                         Pad_4C4A[0x3];                                     // 0x0C35(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
		class UTimelineComponent* Timeline_1;                                        // 0x0C38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UMaterialInstanceDynamic* MonitorMat;                                        // 0x0C40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UMaterialInstanceDynamic* MetalMat;                                          // 0x0C48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32                                         CurrentCaptureCount;                               // 0x0C50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		uint8                                         Pad_4C4B[0x4];                                     // 0x0C54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
		class FText                                   Vend_String;                                       // 0x0C58(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
		class USoundBase* SearchSound;                                       // 0x0C70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class USoundBase* VendFailedSound;                                   // 0x0C78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class USoundBase* CycleSound;                                        // 0x0C80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32                                         CostAmount;                                        // 0x0C88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		uint8                                         Pad_4C4C[0x4];                                     // 0x0C8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
		class UTexture* MaterialType;                                      // 0x0C90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class USoundBase* Vend_Succeeded_Sound;                              // 0x0C98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                          VendSuccess;                                       // 0x0CA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		bool                                          WasHit;                                            // 0x0CA1(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		uint8                                         Pad_4C4D[0x2];                                     // 0x0CA2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
		float                                         CycleSoundVolume;                                  // 0x0CA4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FCurveTableRowHandle                   TossOnGroundSetting;                               // 0x0CA8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
		class FText                                   Wood_String;                                       // 0x0CB8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
		class FText                                   Stone_String;                                      // 0x0CD0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
		class FText                                   Metal_String;                                      // 0x0CE8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
		EFortRarity                                   OverrideVendingMachineRarity;                      // 0x0D00(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		uint8                                         Pad_4C4E[0x7];                                     // 0x0D01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
		class USoundBase* Activate_Rare_Sound;                               // 0x0D08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class FText                                   Free_String;                                       // 0x0D10(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
		class USoundBase* DestroyedSound;                                    // 0x0D28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FScalableFloat                         MaxItemsToSpawn;                                   // 0x0D30(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
		struct FScalableFloat                         ItemsAreFree;                                      // 0x0D50(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
		bool                                          ItemsAreFreeCached;                                // 0x0D70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		uint8                                         Pad_4C4F[0x3];                                     // 0x0D71(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
		int32                                         SpawnedItemCount;                                  // 0x0D74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32                                         MaxItemsToSpawnCached;                             // 0x0D78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		uint8                                         Pad_4C50[0x4];                                     // 0x0D7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
		class USoundBase* Activate_Uncommon_Sound;                           // 0x0D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class USoundBase* Activate_Epic_Sound;                               // 0x0D88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class USoundBase* Activate_Legendary_Sound;                          // 0x0D90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class USoundBase* Ambient_Sound;                                     // 0x0D98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FGameplayTagContainer                  FailedReason;                                      // 0x0DA0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
		struct FGameplayTagContainer                  UpgradeQuestTag;                                   // 0x0DC0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
		struct FLinearColor                           DefaultLightEmissiveColor;                         // 0x0DE0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                          UpgradeAnim;                                       // 0x0DF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		uint8                                         Pad_4C51[0x7];                                     // 0x0DF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
		class USoundBase* Light_Flashing;                                    // 0x0DF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class USoundBase* Impact_Wobble;                                     // 0x0E00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAudioComponent* Search_Audio_Component;                            // 0x0E08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class FText                                   SideGradeString;                                   // 0x0E10(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
		struct FScalableFloat                         HorizontalEnabled;                                 // 0x0E28(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
		float                                         UIShowDistance;                                    // 0x0E48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		float                                         UIDetailDistance;                                  // 0x0E4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FTimerHandle                           UICheckTimer;                                      // 0x0E50(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
		struct FScalableFloat                         AllowDamage;                                       // 0x0E58(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
		class USoundBase* Activate_Sidegrade_Sound;                          // 0x0E78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FGameplayTagContainer                  SidegradeQuestTag;                                 // 0x0E80(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
		struct FScalableFloat                         InteractionTimeSide;                               // 0x0EA0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
		float                                         LightSize;                                         // 0x0EC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		uint8                                         Pad_4C52[0x4];                                     // 0x0EC4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
		struct FScalableFloat                         SpawnPickup;                                       // 0x0EC8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
		bool                                          DoOnce;                                            // 0x0EE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		uint8                                         Pad_4C53[0x7];                                     // 0x0EE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
		class AActor* LinkToActor;                                       // 0x0EF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		ETInteractionType                             NewVar_0;                                          // 0x0EF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		uint8                                         Pad_4C54[0x7];                                     // 0x0EF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
		class FText                                   UpgradeBenchDisplayName;                           // 0x0F00(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
		float                                         Search_Sound_Fade_out_Duration;                    // 0x0F18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	public:
		void UpdateAnimInstanceVisuals();
		void SetUiVisibility(class UWidgetComponent* UITarget, bool ShowDetail, bool ShowDistance);
		void SetLightColor(const struct FLinearColor& NewColor);
		void SetRarityColors(const struct FLinearColor& Color);
		void Timeline_1__FinishedFunc();
		void Timeline_1__UpdateFunc();
		void OnReady_524B43EB45254EC3646C7D81A1AA3359(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
		void PlayUpgradeSuccess(const struct FVector& Color, uint8 Param_Index, EInteractionBeingAttempted InteractionBeingAttempted);
		void BlueprintOnBeginInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType);
		void BlueprintOnInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted);
		void ReceiveBeginPlay();
		void PlayVendFailFX();
		void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
		void OnDamagePlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
		void WobbleMachine();
		void BlueprintOnInteractInterrupted();
		void ReceiveDestroyed();
		void CheckShouldDisplayUI(bool ShowDetail, bool ShowDistance);
		void InitializeUI();
		void BndEvt__SphereDetail_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
		void BndEvt__SphereDetail_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
		void BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
		void BndEvt__CylinderDistance_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
		void OnDeathServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
		void PingMultiCast();
		void BndEvt__FortLinkToActor_K2Node_ComponentBoundEvent_2_OnLinkedActorDestroyed__DelegateSignature();
		void StopSearchSoundLoop();
		void ExecuteUbergraph_B_Athena_Wumba(int32 EntryPoint);

		void LocalOnFailedInteract(const class AFortPlayerPawn* InteractingPawn) const;
		bool BlueprintGetInteractionTime(const class AFortPawn* InteractingPawn, float* OutInteractionTime, const EInteractionBeingAttempted InteractionBeingAttempted) const;
		class FText BlueprintGetFailedInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;
		bool GetOverrideRarity(EFortRarity* Rarity) const;
		class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;

	public:
		static class UClass* StaticClass()
		{
			return StaticBPGeneratedClassImpl<"B_Athena_Wumba_C">();
		}
		static class AB_Athena_Wumba_C* GetDefaultObj()
		{
			return GetDefaultObjImpl<AB_Athena_Wumba_C>();
		}
	};
}