#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_Hightower_HoneyDew_Fist

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "B_Mantis_Weapon_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Hightower_HoneyDew_Fist.B_Hightower_HoneyDew_Fist_C
// 0x0090 (0x0F28 - 0x0E98)
class AB_Hightower_HoneyDew_Fist_C final : public AB_Mantis_Weapon_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Hightower_HoneyDew_Fist_C;        // 0x0E98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      SwingFXNiagraOffhand;                              // 0x0EA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponentBudgeted*         WeaponMesh_Offhand;                                // 0x0EA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SwingFXNiagraMain;                                 // 0x0EB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DecalSize;                                         // 0x0EB8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC4[0x4];                                      // 0x0EC4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInterface*                     ImpactDecal;                                       // 0x0EC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MainhandSocketName;                                // 0x0ED0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OffhandSocketName;                                 // 0x0ED8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WeaponRelativeOffset_Main;                         // 0x0EE0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               WeaponRelativeRotation_Main;                       // 0x0EEC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                WeaponRelativeOffset_Offhand;                      // 0x0EF8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               WeaponRelativeRotation_Offhand;                    // 0x0F04(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FName                                   SwingFXSocketName;                                 // 0x0F10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 PlayerMesh;                                        // 0x0F18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Impact_SFX;                                        // 0x0F20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Hightower_HoneyDew_Fist(int32 EntryPoint);
	void Swing_Right_End();
	void Swing_Left_End();
	void GameplayCue_HighTower_HoneyDew_Fist_Swing4(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GameplayCue_HighTower_HoneyDew_Fist_Smash(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void OnWeaponVisibilityChanged(bool bVisible, bool bSetForLocalControllerOnly);
	void Swing_Right_2();
	void Swing_Right();
	void Swing_Left_2();
	void Swing_Left();
	void K2_OnUnEquip();
	void OnWeaponAttached();
	void OnPlayImpactFX(const struct FHitResult& HitResult, EPhysicalSurface ImpactPhysicalSurface, class UFXSystemComponent* SpawnedPSC);
	void UserConstructionScript();
	void BindDualMeleeSwingEvents();
	void OnInitWeaponCosmetics();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Hightower_HoneyDew_Fist_C">();
	}
	static class AB_Hightower_HoneyDew_Fist_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Hightower_HoneyDew_Fist_C>();
	}
};

}

