#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_Hightower_Wasabi_Claws

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "B_Mantis_Weapon_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Hightower_Wasabi_Claws.B_Hightower_Wasabi_Claws_C
// 0x00E8 (0x0F80 - 0x0E98)
class AB_Hightower_Wasabi_Claws_C final : public AB_Mantis_Weapon_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Hightower_Wasabi_Claws_C;         // 0x0E98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      SwingFXNiagara_Offhand;                            // 0x0EA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponentBudgeted*         WeaponMesh_Offhand;                                // 0x0EA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SwingFXNiagara_Main;                               // 0x0EB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   OffhandSocketName;                                 // 0x0EB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               WeaponRelativeRotation_Main;                       // 0x0EC0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               WeaponRelativeRotation_Offhand;                    // 0x0ECC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FName                                   MainhandSocketName;                                // 0x0ED8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WeaponRelativeOffset_Main;                         // 0x0EE0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WeaponRelativeOffset_Offhand;                      // 0x0EEC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SwingFXSocketName;                                 // 0x0EF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactLocation;                                    // 0x0F00(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F0C[0x4];                                      // 0x0F0C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInterface*                     ImpactDecal;                                       // 0x0F10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ImpactDecalPositionSocketName;                     // 0x0F18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        MainHandDecalLocations;                            // 0x0F20(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FVector>                        OffHandDecalLocations;                             // 0x0F30(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          MainHandFirstDecalLocationIsSet;                   // 0x0F40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OffHandFirstDecalLocationIsSet;                    // 0x0F41(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MainHandDecalLocationsReady;                       // 0x0F42(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OffHandDecalLocationsReady;                        // 0x0F43(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ReadyToAddImpactDecal;                             // 0x0F44(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F45[0x3];                                      // 0x0F45(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         DecalOffset;                                       // 0x0F48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DecalScale;                                        // 0x0F4C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugDecals;                                       // 0x0F58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F59[0x3];                                      // 0x0F59(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         DualDecalGraceWindow;                              // 0x0F5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             UnequipSound;                                      // 0x0F60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             EquipSound;                                        // 0x0F68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         MainHandDirectionalImpactFX;                       // 0x0F70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         OffhandDirectionalImpactFX;                        // 0x0F78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Hightower_Wasabi_Claws(int32 EntryPoint);
	void SetReadyToAddImpactDecalsFalse();
	void TrySpawnDecal();
	void OnPlayImpactFX(const struct FHitResult& HitResult, EPhysicalSurface ImpactPhysicalSurface, class UFXSystemComponent* SpawnedPSC);
	void Swing_Right_2();
	void Swing_Right_End();
	void Swing_Right();
	void Swing_Left_2();
	void Swing_Left_End();
	void Swing_Left();
	void K2_OnUnEquip();
	void OnWeaponDetached();
	void OnWeaponAttached();
	void Bind_Dual_Melee_Swing_Events();
	void Unbind_Dual_Melee_Swing_Events();

	void CalculateDecalRotationFrom2Locations(TArray<struct FVector>& DecalLocations, struct FRotator* DecalRotation) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Hightower_Wasabi_Claws_C">();
	}
	static class AB_Hightower_Wasabi_Claws_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Hightower_Wasabi_Claws_C>();
	}
};

}

