#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_Mantis_Weapon_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "B_Melee_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Mantis_Weapon_Parent.B_Mantis_Weapon_Parent_C
// 0x0060 (0x0E98 - 0x0E38)
class AB_Mantis_Weapon_Parent_C : public AB_Melee_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Mantis_Weapon_Parent_C;           // 0x0E38(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortMantisWeaponComponent*             FortMantisWeapon;                                  // 0x0E40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerCharacter;                                   // 0x0E48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  T_MeleeAttackAbility;                              // 0x0E50(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  T_HudElementToHide;                                // 0x0E70(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           Timer_ShowReticleStatus;                           // 0x0E90(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Mantis_Weapon_Parent(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ShowReticleStatusDisplay();
	void ReticleStatusDisplay(bool Hide);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Mantis_Weapon_Parent_C">();
	}
	static class AB_Mantis_Weapon_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Mantis_Weapon_Parent_C>();
	}
};

}

