#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BGA_HeldWeapon_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BGA_HeldObject_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_HeldWeapon_Parent.BGA_HeldWeapon_Parent_C
// 0x0020 (0x09A0 - 0x0980)
#pragma pack(push, 0x1)
class alignas(0x10) ABGA_HeldWeapon_Parent_C : public ABGA_HeldObject_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BGA_HeldWeapon_Parent_C;            // 0x0980(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bHeldWeaponEquipped;                               // 0x0988(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          bHeldWeaponVisiblePropagateToChildren;             // 0x0989(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_98A[0x6];                                      // 0x098A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class USceneComponent*                        HeldWeaponVisualComponent;                         // 0x0990(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BGA_HeldWeapon_Parent(int32 EntryPoint);
	void OnHeldWeaponEquipToggled(bool bEquipped);
	void HeldWeaponSetEquipped(bool bEquipped);
	void OnRep_bHeldWeaponEquipped();
	void SetHeldWeaponVisualComponent(class USceneComponent* HeldWeaponVisualComponent_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_HeldWeapon_Parent_C">();
	}
	static class ABGA_HeldWeapon_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_HeldWeapon_Parent_C>();
	}
};
#pragma pack(pop)

}

