#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BGA_HighTower_Date_BallLightning_FireMesh

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "BGA_GenericCurieFuel_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_HighTower_Date_BallLightning_FireMesh.BGA_HighTower_Date_BallLightning_FireMesh_C
// 0x0088 (0x08B8 - 0x0830)
class ABGA_HighTower_Date_BallLightning_FireMesh_C final : public ABGA_GenericCurieFuel_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BGA_HighTower_Date_BallLightning_FireMesh_C; // 0x0830(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FScalableFloat                         Data_SelfPropagationFuel;                          // 0x0838(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Data_IgniteNearbyMaterialsRadius;                  // 0x0858(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Data_IgniteNearbyMaterialsFireMagnitude;           // 0x0878(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Data_IgniteNearbyLandscapeRadius;                  // 0x0898(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BGA_HighTower_Date_BallLightning_FireMesh(int32 EntryPoint);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_HighTower_Date_BallLightning_FireMesh_C">();
	}
	static class ABGA_HighTower_Date_BallLightning_FireMesh_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_HighTower_Date_BallLightning_FireMesh_C>();
	}
};

}

