#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BGA_HeldWeapon_Parent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BGA_HeldWeapon_Parent.BGA_HeldWeapon_Parent_C.ExecuteUbergraph_BGA_HeldWeapon_Parent
// 0x0008 (0x0008 - 0x0000)
struct BGA_HeldWeapon_Parent_C_ExecuteUbergraph_BGA_HeldWeapon_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEquipped;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BGA_HeldWeapon_Parent.BGA_HeldWeapon_Parent_C.OnHeldWeaponEquipToggled
// 0x0001 (0x0001 - 0x0000)
struct BGA_HeldWeapon_Parent_C_OnHeldWeaponEquipToggled final
{
public:
	bool                                          bEquipped;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BGA_HeldWeapon_Parent.BGA_HeldWeapon_Parent_C.HeldWeaponSetEquipped
// 0x0002 (0x0002 - 0x0000)
struct BGA_HeldWeapon_Parent_C_HeldWeaponSetEquipped final
{
public:
	bool                                          bEquipped;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BGA_HeldWeapon_Parent.BGA_HeldWeapon_Parent_C.OnRep_bHeldWeaponEquipped
// 0x0002 (0x0002 - 0x0000)
struct BGA_HeldWeapon_Parent_C_OnRep_bHeldWeaponEquipped final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BGA_HeldWeapon_Parent.BGA_HeldWeapon_Parent_C.SetHeldWeaponVisualComponent
// 0x0008 (0x0008 - 0x0000)
struct BGA_HeldWeapon_Parent_C_SetHeldWeaponVisualComponent final
{
public:
	class USceneComponent*                        HeldWeaponVisualComponent_0;                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

