#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: EOSPixelStreaming

#include "Basic.hpp"


namespace SDK::Params
{

// Function EOSPixelStreaming.EOSPixelStreamerDelegates.GetPixelStreamerDelegates
// 0x0008 (0x0008 - 0x0000)
struct EOSPixelStreamerDelegates_GetPixelStreamerDelegates final
{
public:
	class UEOSPixelStreamerDelegates*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EOSPixelStreaming.EOSPixelStreamerInputComponent.AddJsonStringValue
// 0x0048 (0x0048 - 0x0000)
struct EOSPixelStreamerInputComponent_AddJsonStringValue final
{
public:
	class FString                                 Descriptor;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FieldName;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StringValue;                                       // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewDescriptor;                                     // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Success;                                           // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function EOSPixelStreaming.EOSPixelStreamerInputComponent.GetJsonStringValue
// 0x0038 (0x0038 - 0x0000)
struct EOSPixelStreamerInputComponent_GetJsonStringValue final
{
public:
	class FString                                 Descriptor;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FieldName;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StringValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Success;                                           // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function EOSPixelStreaming.EOSPixelStreamerInputComponent.SendPixelStreamingResponse
// 0x0010 (0x0010 - 0x0000)
struct EOSPixelStreamerInputComponent_SendPixelStreamingResponse final
{
public:
	class FString                                 Descriptor;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

