#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: EOSPixelStreaming

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class EOSPixelStreaming.EOSPixelStreamerDelegates
// 0x0010 (0x0038 - 0x0028)
class UEOSPixelStreamerDelegates final : public UObject
{
public:
	TMulticastInlineDelegate<void()>              OnAllConnectionsClosed;                            // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UEOSPixelStreamerDelegates* GetPixelStreamerDelegates();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EOSPixelStreamerDelegates">();
	}
	static class UEOSPixelStreamerDelegates* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEOSPixelStreamerDelegates>();
	}
};

// Class EOSPixelStreaming.EOSPixelStreamerInputComponent
// 0x0018 (0x00C8 - 0x00B0)
class UEOSPixelStreamerInputComponent final : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(const class FString& Descriptor)> OnInputEvent;                    // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void AddJsonStringValue(const class FString& Descriptor, const class FString& FieldName, const class FString& StringValue, class FString* NewDescriptor, bool* Success);
	void GetJsonStringValue(const class FString& Descriptor, const class FString& FieldName, class FString* StringValue, bool* Success);
	void SendPixelStreamingResponse(const class FString& Descriptor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EOSPixelStreamerInputComponent">();
	}
	static class UEOSPixelStreamerInputComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEOSPixelStreamerInputComponent>();
	}
};

// Class EOSPixelStreaming.EOSPixelStreamingSettings
// 0x0030 (0x0068 - 0x0038)
class UEOSPixelStreamingSettings final : public UDeveloperSettings
{
public:
	struct FSoftClassPath                         PixelStreamerDefaultCursorClassName;               // 0x0038(0x0018)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         PixelStreamerTextEditBeamCursorClassName;          // 0x0050(0x0018)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EOSPixelStreamingSettings">();
	}
	static class UEOSPixelStreamingSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEOSPixelStreamingSettings>();
	}
};

}

