#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: F_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP.F_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C
// 0x16C0 (0x1B60 - 0x04A0)
class UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C final : public UCustomCharacterPartAnimInstance_HoneydewHead
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x04B0(0x0108)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x05B8(0x0030)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x05E8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0608(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0710(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0818(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0920(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0A28(0x0108)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x0B30(0x0660)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x1190(0x00C0)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x1250(0x0660)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x18B0(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_1;                  // 0x18D0(0x0140)(ContainsInstancedReference)
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x1A10(0x0140)(ContainsInstancedReference)
	class USkeletalMeshComponent*                 Body_Mesh_b;                                       // 0x1B50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void ExecuteUbergraph_F_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C">();
	}
	static class UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_HighTower_Honeydew_Swole_FaceAcc_AnimBP_C>();
	}
};

}

