#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Hightower_Vertigo_Punch

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GA_Athena_ActivePower_SpawnProjectile_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Hightower_Vertigo_Punch.GA_Hightower_Vertigo_Punch_C
// 0x0050 (0x0FD0 - 0x0F80)
class UGA_Hightower_Vertigo_Punch_C : public UGA_Athena_ActivePower_SpawnProjectile_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Hightower_Vertigo_Punch_C;       // 0x0F80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FTimerHandle                           BeamTimer;                                         // 0x0F88(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 SpawnedProjectile;                                 // 0x0F90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               SpawnedFX;                                         // 0x0F98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HitATarget;                                        // 0x0FA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA1[0x3];                                      // 0x0FA1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FGameplayTag                           T_SuccesfulHitAbilityEnd;                          // 0x0FA4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FAC[0x4];                                      // 0x0FAC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UNiagaraComponent*                      FX_Idle;                                           // 0x0FB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Loop;                                           // 0x0FB8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          GC_LoopDebug;                                      // 0x0FC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FC1[0x7];                                      // 0x0FC1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UNiagaraComponent*                      HandParticle;                                      // 0x0FC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Hightower_Vertigo_Punch(int32 EntryPoint);
	void SpawnIdleFX();
	void Released_Copy();
	void CustomEvent_0();
	void K2_ActivateAbility();
	void Spawn_Hand_FX();
	void DestroyBuildings();
	void Rot(bool Disable);
	void CleanupActors();
	void CastMontageNotifyStart(const struct FGameplayTag& NotifyTag);
	void K2_OnEndAbility(bool bWasCancelled);
	void EventReceived_EAC8A151442E9E691929E8855158C25A(const struct FGameplayEventData& Payload);
	void EventReceived_E5AC2C0545528993D142DAA65B6BCE72(const struct FGameplayEventData& Payload);
	void Targeted_A9C5A41742A949856210408ED2D110E0(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_A9C5A41742A949856210408ED2D110E0(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void ManageLookInput(bool LockLook);
	void OnRep_SpawnedPrj();
	void InitAbility();
	void OnRep_HitATarget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Hightower_Vertigo_Punch_C">();
	}
	static class UGA_Hightower_Vertigo_Punch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Hightower_Vertigo_Punch_C>();
	}
};

}

