#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_HighTower_Vertigo_Punch_Grab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GA_Athena_Knockback_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_HighTower_Vertigo_Punch_Grab.GA_HighTower_Vertigo_Punch_Grab_C
// 0x0030 (0x0D10 - 0x0CE0)
class UGA_HighTower_Vertigo_Punch_Grab_C final : public UGA_Athena_Knockback_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_HighTower_Vertigo_Punch_Grab_C;  // 0x0CE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         DistanceFromInstigator_AI;                         // 0x0CE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ArcParam;                                          // 0x0CEC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0CF0(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PreLaunchVelocity;                                 // 0x0CFC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HitValidTarget;                                    // 0x0D08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D09[0x3];                                      // 0x0D09(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         DistanceFromInstigator_Players;                    // 0x0D0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_HighTower_Vertigo_Punch_Grab(int32 EntryPoint);
	void DoLaunch(const struct FVector& Vel);
	void LaunchAI(class AFortPawn* Target_0);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnFinished_091FAD184EDE104473C126A49066AF43(bool DestinationReached, bool TimedOut, const struct FVector& FinalTargetLocation);
	void Find_Launcher(class AActor* DefaultLauncher, class AActor** LauncherOut);
	void HandleMomentum();
	void OnRep_Momentum();
	struct FVector MomentumCheck(const struct FVector& PreMomentumLaunchvelocity);
	void CalculateStartAndEndPos(struct FVector* Start, struct FVector* End);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_HighTower_Vertigo_Punch_Grab_C">();
	}
	static class UGA_HighTower_Vertigo_Punch_Grab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_HighTower_Vertigo_Punch_Grab_C>();
	}
};

}

