#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GameplayStateMachine

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GameplayStateMachine.GameplayState.BeginState
// 0x0008 (0x0008 - 0x0000)
struct GameplayState_BeginState final
{
public:
	struct FGameplayTag                           PrevStateId;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayState.EndState
// 0x0008 (0x0008 - 0x0000)
struct GameplayState_EndState final
{
public:
	struct FGameplayTag                           NextStateId;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayState.UpdateState
// 0x0004 (0x0004 - 0x0000)
struct GameplayState_UpdateState final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayState.GetStateId
// 0x0008 (0x0008 - 0x0000)
struct GameplayState_GetStateId final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayStateMachine.SetState
// 0x0008 (0x0008 - 0x0000)
struct GameplayStateMachine_SetState final
{
public:
	struct FGameplayTag                           InStateId;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayStateMachine.GetActiveStateId
// 0x0008 (0x0008 - 0x0000)
struct GameplayStateMachine_GetActiveStateId final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayStateMachine.GetActiveStateObject
// 0x0008 (0x0008 - 0x0000)
struct GameplayStateMachine_GetActiveStateObject final
{
public:
	class UGameplayState*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GameplayStateMachine.GameplayStateMachine.GetStateMachineId
// 0x0008 (0x0008 - 0x0000)
struct GameplayStateMachine_GetStateMachineId final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

