#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: HighTowerCobaltRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class HighTowerCobaltRuntime.FortAthenaMutator_CobaltHighTower
// 0x00B0 (0x0CD0 - 0x0C20)
class AFortAthenaMutator_CobaltHighTower final : public AFortAthenaMutator_Cobalt
{
public:
	struct FGameplayTag                           ShowAbilityIntroTag;                               // 0x0C20(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         bPreventDamageToBuildingsDuringWarmup;             // 0x0C28(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         bAllowBuildingDuringWarmup;                        // 0x0C48(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSubclassOf<class UGameplayEffect>            BlockBuildAbilityGameplayEffect;                   // 0x0C68(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           JumpAbilityActionTag;                              // 0x0C70(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortAthenaMutator_InventoryOverride_Bucket* InventoryOverrideBucketMutator;               // 0x0C78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C80[0x50];                                     // 0x0C80(0x0050)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_CobaltHighTower">();
	}
	static class AFortAthenaMutator_CobaltHighTower* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_CobaltHighTower>();
	}
};

}

