#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Prj_HighTower_Vertigo_Punch

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Prj_Athena_HappyGhost_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prj_HighTower_Vertigo_Punch.Prj_HighTower_Vertigo_Punch_C
// 0x0220 (0x0CB8 - 0x0A98)
class APrj_HighTower_Vertigo_Punch_C final : public APrj_Athena_HappyGhost_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prj_HighTower_Vertigo_Punch_C;      // 0x0A98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_HighTower_Vertigo_HandMesh_FX;                  // 0x0AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_HighTower_Vertigo_HandAnimation;                // 0x0AA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hightower_Vertigo_HandAnimation_HandA;          // 0x0AB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NotHit_Disslove_Hand_0BF32E8D47C94B4ED4E80BB7EC6F4D3C; // 0x0AB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NotHit_Disslove_0BF32E8D47C94B4ED4E80BB7EC6F4D3C; // 0x0ABC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NotHit_SinIntensity_0BF32E8D47C94B4ED4E80BB7EC6F4D3C; // 0x0AC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NotHit_SinMotion_0BF32E8D47C94B4ED4E80BB7EC6F4D3C; // 0x0AC4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NotHit_SinLength_0BF32E8D47C94B4ED4E80BB7EC6F4D3C; // 0x0AC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_NotHit__Direction_0BF32E8D47C94B4ED4E80BB7EC6F4D3C; // 0x0ACC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ACD[0x3];                                      // 0x0ACD(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     Timeline_NotHit;                                   // 0x0AD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Hit_Dissolve_F084086F4016AF8D762061A514DCCEE7; // 0x0AD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Hit_SinIntensity_F084086F4016AF8D762061A514DCCEE7; // 0x0ADC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Hit_SinLength_F084086F4016AF8D762061A514DCCEE7; // 0x0AE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_Hit__Direction_F084086F4016AF8D762061A514DCCEE7; // 0x0AE4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE5[0x3];                                      // 0x0AE5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     Timeline_Hit;                                      // 0x0AE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset_Distance_from_Physics_Mesh;                 // 0x0AF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OffsetDistanceFromBone;                            // 0x0AF4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HitValidTarget;                                    // 0x0AF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF9[0x7];                                      // 0x0AF9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         DataHomingTurnSpeedMin;                            // 0x0B00(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         DataHomingRectWidth;                               // 0x0B20(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         DataHomingTurnSpeedMax;                            // 0x0B40(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         DataHomingRange;                                   // 0x0B60(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         DataHomingRectHeight;                              // 0x0B80(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFortPlayerPawn*                        HomingTarget;                                      // 0x0BA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetHomingOffset;                                // 0x0BA8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnTimerExpired;                                // 0x0BB4(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_BB5[0x3];                                      // 0x0BB5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                ReturnHomingOffset;                                // 0x0BB8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC4[0x4];                                      // 0x0BC4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<EObjectTypeQuery>                      WhileLeapingTargetObjectTypes;                     // 0x0BC8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 GE_WhileLeapingHit;                                // 0x0BD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WhileLeapingEffectLevel;                           // 0x0BE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE4[0x4];                                      // 0x0BE4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0BE8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	class AActor*                                 BullDozer;                                         // 0x0BF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      HandParticle;                                      // 0x0C00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hit;                                               // 0x0C08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C09[0x3];                                      // 0x0C09(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FHitResult                             HitInfo;                                           // 0x0C0C(0x008C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameplayTag                           T_DamageImmune;                                    // 0x0C98(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartingLocation;                                  // 0x0CA0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_CancelAbility;                                   // 0x0CAC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Prj_HighTower_Vertigo_Punch(int32 EntryPoint);
	void ReceiveBeginPlay();
	void CustomEvent_1();
	void Hit_Copy();
	void CustomEvent_0();
	void OnAttachedToDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void BulidingDestructionTrace();
	void OnReachedLockTargetDistanceThreshold();
	void TriggerReturn();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit_0);
	void Timeline_Hit__UpdateFunc();
	void Timeline_Hit__FinishedFunc();
	void Timeline_NotHit__UpdateFunc();
	void Timeline_NotHit__FinishedFunc();
	void UserConstructionScript();
	void SetHomingVars(bool Return_);
	void OnRep_ReturnTimerExpired();
	void BuildingDestruction(TArray<struct FHitResult>& Array);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prj_HighTower_Vertigo_Punch_C">();
	}
	static class APrj_HighTower_Vertigo_Punch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrj_HighTower_Vertigo_Punch_C>();
	}
};

}

