#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ScoreRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class ScoreRuntime.FortAthenaMutator_Score
// 0x01F0 (0x0460 - 0x0270)
class AFortAthenaMutator_Score final : public AFortAthenaMutator
{
public:
	int32                                         NumCoinWaves;                                      // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSupportsRespawnConfig;                            // 0x0274(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRespawnsAllowed;                                  // 0x0275(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_276[0x2];                                      // 0x0276(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         StopRespawnPhase;                                  // 0x0278(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FFortRespawnLogicData                  RespawnLogicData;                                  // 0x0298(0x0100)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   GameMsgText_Intro;                                 // 0x0398(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   GameMsgText_FirstCoinsSpawned;                     // 0x03B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   GameMsgText_CoinsSpawned;                          // 0x03C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FAthenaGameMessageData                 GameMsg_NoMoreRespawnsWarning;                     // 0x03E0(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FAthenaGameMessageData                 GameMsg_NoMoreRespawns;                            // 0x0420(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void OnGamePhaseStepChanged(const TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, const EAthenaGamePhaseStep GamePhaseStep);
	void OnMutatorGameplayEvent(int32 EventId, int32 EventParam1, int32 EventParam2, int32 EventParam3);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_Score">();
	}
	static class AFortAthenaMutator_Score* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_Score>();
	}
};

}

